БухЭксп/ChartsOfAccounts/CW_МСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>CW_МСФО</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.CW_ВидыСубконтоМСФО</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользованиеВРучныхОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

БухЭксп/CommonModules/CW_БухгалтерскийУчетВызовСервераПовтИспМСФО/Ext/Module.bsl
#Область СвойстваСчетов

Функция ПолучитьСвойстваСчета(Знач Счет) Экспорт

	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка"                         , ПланыСчетов.CW_МСФО.ПустаяСсылка());
	ДанныеСчета.Вставить("Наименование"                   , "");
	ДанныеСчета.Вставить("Код"                            , "");
	ДанныеСчета.Вставить("Родитель"                       , ПланыСчетов.CW_МСФО.ПустаяСсылка());
	ДанныеСчета.Вставить("Вид"                            , Неопределено);
	ДанныеСчета.Вставить("Забалансовый"                   , Ложь);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	ДанныеСчета.Вставить("УчетПоПодразделениям" 		  , Ложь);
	ДанныеСчета.Вставить("Валютный"                       , Ложь);
	ДанныеСчета.Вставить("Количественный"                 , Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто"             , 0);
	
	МаксКоличествоСубконто = CW_БухгалтерскийУчетМСФО.МаксимальноеКоличествоСубконто();
	
	Для ИндексСубконто = 1 По МаксКоличествоСубконто Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      Ложь);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_МСФО.Ссылка КАК Ссылка,
	|	CW_МСФО.Родитель КАК Родитель,
	|	CW_МСФО.Код КАК Код,
	|	CW_МСФО.Наименование КАК Наименование,
	|	CW_МСФО.Вид КАК Вид,
	|	CW_МСФО.Забалансовый КАК Забалансовый,
	|	CW_МСФО.ЗапретитьИспользоватьВПроводках КАК ЗапретитьИспользоватьВПроводках,
	|	CW_МСФО.Валютный КАК Валютный,
	|	CW_МСФО.Количественный КАК Количественный,
	|	CW_МСФО.УчетПоПодразделениям КАК УчетПоПодразделениям
	|ИЗ
	|	ПланСчетов.CW_МСФО КАК CW_МСФО
	|ГДЕ
	|	CW_МСФО.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_МСФОВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	CW_МСФОВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	CW_МСФОВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	CW_МСФОВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
	|	CW_МСФОВидыСубконто.ТолькоОбороты КАК ТолькоОбороты,
	|	CW_МСФОВидыСубконто.Суммовой КАК Суммовой
	|ИЗ
	|	ПланСчетов.CW_МСФО.ВидыСубконто КАК CW_МСФОВидыСубконто
	|ГДЕ
	|	CW_МСФОВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	CW_МСФОВидыСубконто.НомерСтроки";
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
		
	ВыборкаВидыСубконто	= МассивРезультатов[1].Выбрать();
		
	ДанныеСчета.КоличествоСубконто	= ВыборкаВидыСубконто.Количество();
		
	ИндексСубконто	= 0;
		
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		
		ИндексСубконто	= ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      ВыборкаВидыСубконто.Суммовой);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеСчета);
	
КонецФункции

Функция НаСчетеВедетсяУчетПоНоменклатурнымГруппам(Счет) Экспорт
	
	СвойстваСчета = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.ПолучитьСвойстваСчета(Счет);
	
	УчетПоНомГруппам = СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.НоменклатурныеГруппы
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.НоменклатурныеГруппы
		ИЛИ СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.НоменклатурныеГруппы;
	
	Возврат УчетПоНомГруппам;
	
КонецФункции

Функция НаСчетеВедетсяУчетПоДоходамИРасходам(Счет) Экспорт
	
	СвойстваСчета = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.ПолучитьСвойстваСчета(Счет);
	
	УчетПоДоходамИРасходам = СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.ПрочиеДоходыИРасходы
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.ПрочиеДоходыИРасходы
		ИЛИ СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.ПрочиеДоходыИРасходы;
	
	Возврат УчетПоДоходамИРасходам;
	
КонецФункции

Функция НаСчетеВедетсяУчетПоСтатьямЗатрат(Счет) Экспорт
	
	СвойстваСчета = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.ПолучитьСвойстваСчета(Счет);
	
	УчетПоДоходамИРасходам = СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.СтатьиЗатрат
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.СтатьиЗатрат
		ИЛИ СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.CW_ВидыСубконтоМСФО.СтатьиЗатрат;
	
	Возврат УчетПоДоходамИРасходам;
	
КонецФункции

//Функция возвращает типы значений субконто, связанных с именами реквизитов.
//
// Возвращаемое значение:
//   Соответствие   - ключ - имя реквизита, значение - описание типов связанных значений субконто.
//
Функция ВсеТипыСвязанныхСубконто() Экспорт
	
	СвязанныеСубконто = Новый Соответствие;
	
	CW_БухгалтерскийУчетПереопределяемыйМСФО.УстановитьТипыСвязанныхСубконто(СвязанныеСубконто);
	
	СвязанныеСубконто.Вставить("Организация", CW_БухгалтерскийУчетПереопределяемыйМСФО.ТипыСвязанныеСОрганизацией());
	
	Возврат СвязанныеСубконто;
	
КонецФункции


#КонецОбласти

#Область ИспользованиеОднойНоменклатурнойГруппы

// Функция возвращает признак использования одной номенклатурной группы.
//
Функция ИспользоватьОднуНоменклатурнуюГруппу() Экспорт

	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоНоменклатурныхГрупп") 
		И ЗначениеЗаполнено(CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.ОсновнаяНоменклатурнаяГруппа());

КонецФункции

// Функция получает единственную номенклатурную группу.
//
// Возвращаемое значение:
//		Основная номенклатурная группа - Тип НоменклатурныеГруппы, если ничего не найдено, то возвращается пустая ссылка.
Функция ОсновнаяНоменклатурнаяГруппа() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НЕ НоменклатурныеГруппы.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	// Если опция ВестиУчетПоНесколькимНоменклатурнымГруппам выключена, но номенклатурная группа одна,
	// то все равно подставляем эту номенклатурную группу.
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ОсновнаяНоменклатурнаяГруппа = Выборка.Ссылка;
	Иначе
		ОсновнаяНоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ОсновнаяНоменклатурнаяГруппа;

КонецФункции

#КонецОбласти
